Repository: DynamicDesignz/jackman
Catalog: po/*.po
Languages: de

source: this script configures the audio device given by environment variables $DEVNAME and $ID_MODEL (see udev parameter description) or the device with highest priority as jackdbus master if it has a higher priority than the current master (as specified in $HOME/${configfile}), starts jackdbus and adds alsa_in and alsa_out devices for all other audio devices. parameters: -h show this -v verbose output -m set value for ID_MODEL -n set value for DEVNAME -f force replace (see FORCEREPLACE in next section) -d set value for DEVICE -b set value for BLACKLIST, e.g. "HDA Intel MID,3" environment variables used by this script: ID_MODEL: model id of the device as given by udev DEVNAME: device name as given by udev FORCEREPLACE: if not empty the current master will always be replaced, regardless of its priority DEVICE: if set to an integer number, the device of the given card with id $DEVICE will be used, regardless of its priority BLACKLIST: dont use devices with name in semicolon separated list $BLACKLIST parameters used for jack_control can be specified in $HOME/${configfile} common issues: if ulimit is too low (errors like "cannot lock down memory" appear) place the following line in /etc/pam.d/su: session required pam_limits.so
de: Dieses Skript konfiguriert für das Audiointerface, welches durch die Umgebungsvariablen$DEVNAME und $ID_MODEL (siehe Beschreibung der entsprechenden udev-Parameter) angegeben wurde, das Gerät mit der höchsten Priorität als Master für jackdbus, sofern es eine höhere Priorität als das aktuelle Gerät besitzt (wie in $HOME/${configfile} spezifiziert), startet jackdbus und bindet alsa_in und alsa_out Geräte für alle vorhandenen Audiointerfaces ein. Parameter: -h Zeige diese Hilfe -v ausführliche Ausgaben -m setze Umgebungsvariable ID_MODEL -n setze Umgebungsvariable DEVNAME -f erzwinge Ersetzung (siehe FORCEREPLACE im nächsten Abschnitt) -d setze Umgebungsvariable DEVICE -b setze Umgebungsvariable BLACKLIST, z.B.:. "HDA Intel MID,3" Von diesem Skript verwendete Umgebungsvariablen: ID_MODEL: Modellname des Audiointerfaces, wie in udev angegeben. DEVNAME: Name des Audiointerfaces, wie in udev angegeben. FORCEREPLACE: Falls nicht leer, wird der aktuelle Master stets ersetzt, unabhängig von seiner Priorität. DEVICE: Falls gesetzt, wird das Gerät mit Nummer $DEVICE verwendet, unabhängig von seiner Priorität. BLACKLIST: Semikolon-separierte Liste von Geräten, die nicht verwendet werden sollen. Parameter, die von jack_control für bestimmte Geräte verwendet werden, können in $HOME/${configfile} gesetzt werden. Häufige Probleme: Falls ulimit zu niedrig eingestellt erscheint (Fehler wie "cannot lock down memory" treten auf), ergänzen Sie die folgende Zeile in /etc/pam.d/su: session required pam_limits.so

source: Attaching hw:${card},${device}.
de: Binde hw:${card},${device} ein.

source: no card given, using card with highest priority
de: Kein Audiointerface wurde angegeben. Verwende Interface mit höchster Priorität.

source: jack user is ${jackuser}
de: JACK Benutzer ist ${jackuser}

source: reading config from $jackhome/${configfile}
de: Lese Konfiguration aus $jackhome/${configfile}

source: blacklisted devices:
de: Ignoriere Geräte:

source: have config for:
de: Konfiguration vorhanden für:

source: using $device
de: Verwende Gerät $device

source: old card's priority was ${oldprio}. new card's best priority is ${prio}
de: Die Priorität des vorherigen Geräts war ${oldprio}. Das neue Gerät hat Priorität ${prio}.

source: replacing forced.
de: Erzwinge Masterwechsel.

source: attaching alsa_in and alsa_out...
de: Binde alsa_in und alsa_out ein...

source: Attached ${SHORTNAME}.
de: ${SHORTNAME} wurde eingebunden.

source: replacing...
de: Ersetze Master...

source: no device set. trying device 0.
de: Kein Gerät angegeben. Versuche Gerät 0.

source: using config:
de: Verwende Konfiguration:

source: Buffer size changed from ${oldval} to ${newval}.
de: Die Puffergröße wurde von ${oldval} auf ${newval} geändert.

source: Could not start jack.
de: Konnte JACK nicht starten.

source: Try again with other device parameters.
de: Versuchen Sie es noch einmal mit anderen Einstellungen.

source: Switched master to ${SHORTNAME},${device}.
de: ${SHORTNAME},${device} wird als neuer Master verwendet.

source: Switched master from ${currentname},${currentdevice} to ${SHORTNAME},${device}.
de: Statt ${currentname},${currentdevice} wird ${SHORTNAME},${device} als neuer Master verwendet.

source: Removed card ${currentcard}. Trying to switch master...
de: Audiointerface ${currentcard} wurde entfernt. Versuche, auf einen neuen Master zu wechseln...
